[{"rating": "4", "about": "IEEE Computer Society (sometimes abbreviated Computer Society or CS) is the world's premier organization of computing professionals with rich offerings in publications, standards, certifications, conferences, and more. Their purpose and scope is to advance the theory, practice, and application of computer and information processing science and technology and the professional standing of its members. They organise both workshops and events such as GET ENCRYPTED, LIVE MONOPOLY etc.", "name": "IEEE COMPUTER SOCIETY", "tags": ["computer science"], "abbrivation": "IEEE CS", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/IEEEVIT?fref=ts", "type": "ieee"}, {"rating": "3", "about": "IEEE Women in Engineering (WIE) is the largest international professional organization dedicated to promoting women engineers and scientists. IEEE-WIE VIT also consists of young ,determined and enthusiastic women engineers who strive to carve a niche for themselves. The mission of IEEE WIE is to inspire, engage, encourage, and empower IEEE women worldwide. IEEE WIE VIT organises not only technical events such as SPY-CODE, SUDO-CODE etc. But also fun events like MANAGEMENT GURU and BORN FREE.", "name": "IEEE WIE", "tags": ["women"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/IEEEWIEVIT?fref=ts", "type": "ieee"}, {"rating": "3", "about": "IEEE PCS aspires To foster a community dedicated to understanding and promoting effective communication in engineering, scientific, and other technical environments. To this end, the IEEE Professional Communication Society endeavors to: Advance technical and scientific communication as an essential element of engineering;Help engineers, scientists, and other technically oriented professionals to communicate better in the workplace--both in speaking and in writing, both verbally and nonverbally.Promote and disseminate best practices and research results on the development, maintenance, delivery, and management of technical content; and, Promote and facilitate leading-edge education and training of engineers, scientists, and other technically oriented professionals in communication theory and practice", "name": "IEEE PES", "tags": ["mechanical"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/ieee.pes.vit?fref=ts", "type": "ieee"}, {"rating": "3", "about": "IEEE-RAS (ROBOTICS & AUTOMATION SOCIETY) is a VIT student chapter by IEEE to enhance the knowledge of students in the field of Robotics & Automation.They strive to advance innovation, education, and fundamental and applied research in Robotics and Automation. Robotics focuses on systems incorporating sensors and actuators that operate autonomously or semi-autonomously in cooperation with humans. Robotics research emphasizes intelligence and adaptability to cope with unstructured environments.This chapter organises events such as ROBOSTACLE 1.0, LANKA RELOADED , WORKSHOP ON CLOUD computing and internet of things.", "name": "IEEE ROBOTICS AND AUTOMATION SOCIETY", "tags": ["robotics"], "abbrivation": "IEEE RAS", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/IEEERASVIT?fref=ts", "type": "ieee"}, {"rating": "3", "about": "IEEE-EMBS, Engineering in Medicine and Biology, is an up-and-coming student chapter at VIT. EMBS is the worlds largest society for Biomedical Engineers.At VIT, IEEE-EMBS aspires to enhance the skills and knowledge of students and help them flourish as professionals in Biomedical Engineering.Due to the multidisciplinary nature of Biomedical Engineering, it provides scope for students from all branches. If you wish to contribute your expertise to the medical sector then EMBS is the ideal platform for you. EMBS will be bringing to you fun-filled, intriguing and challenging competitions, workshops and other events Such as ORGOTRONICS, Seminar on ultrasound technology etc.", "name": "IEEE EMBS", "tags": ["medical", "biology"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/ieeeembs?fref=ts", "type": "ieee"}, {"rating": "3", "about": "The IEEE-Electron Device Society, Student Chapter of Vellore Institute of Technology (VIT) University, TN, India was inaugurated on September 4, 2010. by Prof. Ramgopal Rao, IIT Bombay, Vice Chair, IEEE -EDS, Region 10. The Society is concerned with research, development, design and manufacture related to materials, processing, technology, and applications of such devices, and scientific, technical, educational and other activities that contribute to the advancement of this field\"The chapter conducts training program, technical talk , workshop in the field of semiconductor and technology. It also conduct student technical activiities like Quizzes, Technical Debate etc.", "name": "IEEE EDS", "tags": ["research"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/EDSVIT?fref=ts", "type": "ieee"}, {"rating": "3", "about": "The Indian Society for Technical Education (ISTE) is the premier non-profit organization serving educators and education leaders committed to empowering connected learners in a connected world. ISTE serves more than 100,000 education stakeholders throughout the world.ISTE membership is a powerful way for educators to connect with peers, share knowledge and ideas, and help lead the transformation of education. ISTE also offers innovative ed tech resources to support professional learning for educators and education leaders.", "name": "ISTE", "tags": ["knowledge"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/ISTE.VIT?fref=ts", "type": "indian"}, {"rating": "2", "about": "The Institution of Electronics and Telecommunication Engineers (IETE) is India's leading recognized professional society devoted to the advancement of Science and Technology of Electronics, Telecommunication & IT. Founded in 1953, it serves more than 69,000 members through various centers, whose number is 57, spread all over India and abroad. The Institution provides leadership in Scientific and Technical areas of direct importance to the national development and economy. Government of India has recognized IETE as a Scientific and Industrial Research Organization (SIRO) and also notified as an educational Institution of national eminence. The objectives of IETE focus on advancing electro-technology. The IETE conducts and sponsors technical meetings, conferences, symposia, and exhibitions all over India, publishes technical journals and provides continuing education as well as career advancement opportunities to its members.", "name": "IETE", "tags": ["electronics"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/pages/Institution-of-Electronics-and-Telecommunication-Engineers/111349285583234?fref=ts", "type": "indian"}, {"rating": "2", "about": "Indian Institute Of Chemical Engineers is a confluence of streams of professionals from academia, research institute and industry. It provides them the appropriate forum for joint endeavours, hand-in-hand, to work for human being through application of chemical engineering and allied sciences. If you are interested about, attached to or involved in chemical engineering related activities  whether as a student as a seasoned professional - you shall find the program of IICHE immensely beneficial, opening up doors of new possibilities and existing possibilities.", "name": "IIChE", "tags": ["chemical"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/iichevit?fref=ts", "type": "indian"}, {"rating": "5", "about": "Formed in 1965, the Computer Society of India (National) has been instrumental in guiding the Indian IT industry down the right path during its formative years. Today, the CSI has 66 chapters all over India, 381 student branches, and more than 40000 members. The promotion of Information Technology as a profession is the top priority of CSI today. To fulfill this objective, the CSI - VITU Chapter regularly organizes conferences, conventions, lectures and gives various awards.", "name": "CSI", "tags": ["computer science"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/csivit?fref=ts", "type": "indian"}, {"rating": "3", "about": "The Society of Instrumentation professionals was established in the year 1970, with headquarters at Indian Institute of Science, Bangalore. It strives to act as a link between academic institutions and the instrumentation industry, by organizing several programs. It also conducts programs for students and working professionals in the form of short term courses, symposia and topical reviews.", "name": "ISOI", "tags": ["research"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/The-Instrument-Society-of-India-ISOI-VIT-Student-Chapter-137430359623172/timeline/", "type": "indian"}, {"rating": "3", "about": "The International Society of Automation is a non-profit professional association that sets the standard for those who apply engineering and technology to improve the management, safety, and cybersecurity of modern automation and control systems used across industry and critical infrastructure. ISA VIT provides education and training, publishes books and technical articles, hosts conferences and exhibits, provides networking and career development programs.", "name": "ISA", "tags": ["computer science"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/isavitchapter?fref=ts", "type": "international"}, {"rating": "4", "about": "Toastmasters International is a world leader in communication and leadership development. The club membership is more than 332,000 members all over the world. Members improve their speaking and leadership skills by attending one of the 15,400 clubs in 135 countries. VIT is the proud home to 8 clubs- Phoenix, Agua, Fogo, Clima, Terra, Nuvens, Brisa and Ora.", "name": "TMI", "tags": ["leadership"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/tmivit?fref=ts", "type": "international"}, {"rating": "2", "about": "This Indian chapter wants to eradicate corruption as a whole. Its mission statement being Empowering India to live a corruption free life. This chapter holds many Online Right to Information act talks, TV Talk shows and other discussion arenas that would strike people to think and work together in putting down this evil.", "name": "Fifth Pillar", "tags": ["knowledge"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/5pvit?fref=ts", "type": "international"}, {"rating": "3", "about": "IET-VIT a students' representative group in VIT of Europe's largest and the World's second largest professional society is dedicated to sharing and spreading global technical and technological knowledge among the students of VIT University to help them become standouts in their careers by providing them training and inspiration unavailable in the confines of their classrooms.", "name": "IET-VIT", "tags": ["knowledge"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/IET-VIT-126206870767425/timeline/", "type": "international"}, {"rating": "4", "about": "The Association for Computing Machinery (ACM) is a US based international learned society for computing. It was founded in 1947 and is the world's largest and most prestigious scientific and educational computing society. The ACM India Council is an effort of ACM aimed at increasing the level and visibility of ACM activities across India. The ACM community in India is growing in membership, with the VIT chapter holding sponsored conferences and symposia.", "name": "ACM", "tags": ["computer science"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/ACM.VITU", "type": "international"}, {"rating": "3", "about": "SME is an organization for individuals, students, educators and companies involved in all facets of manufacturing. Founded in 1932, it is dedicated to advancing and educating the manufacturing industry. This is accomplished through a variety of tactics and outlets including events, media, membership, training and development, and an education foundation. SME focuses its efforts on several areas of manufacturing: aerospace and defence, energy, medical and motorized vehicles.", "name": "SME", "tags": ["research"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/smevit", "type": "international"}, {"rating": "2", "about": "SAE International is a global association of more than 138,000 engineers and related technical experts in the aerospace, automotive and commercial-vehicle industries. SAE International's core competencies are life-long learning and voluntary consensus standards development. SAE International's charitable arm is the SAE Foundation, which supports many programs, including A World In Motion and the Collegiate Design Series.", "name": "SAE", "tags": ["research"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/saevit?fref=ts", "type": "international"}, {"rating": "4", "about": "+To all the aspiring astronomers, A perfect start to dwell deep into your interest, SEDS-VIT Amateur Astronomy Club, founded in 2007 is the headquarters of SEDS India.It strives to be an independent student-based organisation that encourages the exploration and development of space. It enables students to discuss and implement space and space-enabled technologies by encouraging them to build prototypes of space systems, conducting paper presentations and carrying out research to accelerate the development of lateral space related fields like space art , space music , space literature, space law etc. The club has also been recognised widely and been honoured by the following titles  VIT University's 'Best Student Chapter Award 2008',  VIT University's 'Best Student Chapter Award 2009' and  VIT University's 'Best Student Chapter Award 2011'.  Email-seds.vit@outlook.com  Website-http://www.sedsindia.org/", "name": "SEDS-VIT", "tags": ["astronomy"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/SEDSVIT/timeline", "type": "university"}, {"rating": "3", "about": "The Student Chapter of VIT Material Advantage strives to promote education and the enhancement of knowledge in the field of Metals. Their activities are targeted towards Professional and Scientific Development for students in Materials Studies. They are meant to complement education at the university, and both deepen and broaden our perspective on Metals and Materials.", "name": "VIT Materials Advantage", "tags": ["materials", "research"], "abbrivation": "VITMAS", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/ASM.VIT?fref=ts", "type": "university"}, {"rating": "3", "about": "AIESEC, the world's largest student-run organization, is the international platform for students and recent graduates to explore and develop their potential to have a positive impact on society. Focused on providing a platform for youth leadership development, AIESEC offers young people the opportunity to be global citizens, to change the world, and to get experience and skills that matter today. Its members are part of an exciting, driven global network. They are able to contribute to societal change while exploring their own vision for a positive impact on society.They are supported by thousands of partner organisations around the globe who look to AIESEC to support the development of youth and to access top talent through our global internship program..", "name": "AIESEC VIT", "tags": ["development"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/aiesec.vit?fref=ts", "type": "american"}, {"rating": "4", "about": "VIT in association with American Society of Civil Engineers (ASCE) is a VIT Student Chapter which conducts various activities like Expert Lectures, Site Visits, Workshops, Seminars, Student Competitions related to various aspects of Civil Engineering . Their mission is to Provide essential value to their members and partners, advance civil engineering, and serve the public good.In carrying out their mission, ASCE: Advances technology Encourages lifelong learning Promotes professionalism and the profession Develops civil engineer leaders Advocates infrastructure and environmental stewardship", "name": "ASCE", "tags": ["civil"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/asceVIT?fref=ts", "type": "american"}, {"rating": "4", "about": "The American Society of Mechanical Engineers VIT promotes the art, science and practice of multidisciplinary engineering and allied sciences around the globe. They wish To serve our diverse global communities by advancing, disseminating and applying engineering knowledge for improving the quality of life; and communicating the excitement of engineering. From college students and early-career engineers to project managers, corporate executives, researchers and academic leaders, ASME's members are as diverse as the engineering community itself. ASME serves this wide-ranging technical community through quality programs in continuing education, training and professional development, codes and standards, research, conferences and publications, government relations and other forms of outreach.", "name": "ASME", "tags": ["mechanical"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/ASME.BPDC?fref=ts", "type": "american"}, {"rating": "3", "about": "We at Vellore Institute of Technology believe that AIChE student chapter is the right candidate to further develop chemical engineering skills,expertise and exposure. It will definetly prove to be a stepping stone in furthering the cause,to impart futuristic technical education which is a part of our vision statement in VIT. Being only the second AIChE student chapter in India, Their aim is to further strengthen the core values and beliefs of AIChE. Also they plan on inviting industry representatives from various specialities to inform and impart the students of the skill-set required in the professional world. In the ever changing scenario of India where change is the only constant, we will be required to equip ourselves with the latest in the field, AIChE-VIT sees itself as the bridge to acquaint us with the required knowledge.CARBON CREDITS, PIC-A-CLUE AND ELEMENtARy are said to be their main events.", "name": "AICHE", "tags": ["chemical"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "https://www.facebook.com/aichevit?fref=ts", "type": "american"}, {"rating": "2", "about": "Team Eklavya is a group of aspiring civil engineers, operating at VIT University, aimed to blend theory with practice. Eklavya was formed with the objective of expanding our knowledge base and exposing ourselves to new technologies in practical situations. We recently participated in National Concrete Canoe Competetion, USA organized by the ASCE. This competetion generates awareness about the versatility and durability of concrete as a construction material and durability of concrete as a construction material and serve as an experience for the students. We are thus gearing up for a very unique experience and would like you to be a part of this journey where we transform our dreams to reality.", "name": "TEAM EKLAVYA", "tags": ["civil"], "abbrivation": "", "clb_or_chap": "chapter", "facebook": "", "type": "american"}, {"rating": "4", "about": "Creativity is inventing, experimenting, growing, taking risks, breaking rules, making mistakes, and having fun.  Mary Lou Cook Being one of the most active clubs in VIT, they believe its the invariable right of a person to pursue his heart and his passion. The club is for the people who have an unquenchable thirst to be different. Technical and informal events and workshops throughout the year are conducted - be it Contraptions, which involve the application of engineering concepts of several streams or a quizzing event inspired by a hit App, LIVE QuizUp or even comedy events like Open Mic. Over the years celebratory events like \"Kite Flying\" on 15th August and also Thank you- Teachers for Teacher's Day which are basic expressions of gratitude have been conducted to spread the smile. Albert Einstein once said Creativity is contagious, pass it on. The members look forward to pass on this candle of light so others also may be enlightened too.", "name": "Creativity Club", "tags": ["art"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/VITCreativityClub?fref=ts", "type": "arts"}, {"rating": "5", "about": "The VIT dance club is the most happening club in VIT. Consisting of 6 teams  Classical (Maya) , Hip Hop team (Party Dancers) , Association (PDA) , Bhangra team (Jatts and Juliets) , Cinematics team (Chargers) , Bollywood (Bollywood Badmash Company) , IndoJazz (Mirage) they leave the audience awestruck and once more is never enough! The brilliant dancers have taken dance to a new level and won many laurels for our University. Our dancers have proved that dancing with the feet is one thing, and dancing with the heart is another!", "name": "VIT Dance Club", "tags": ["dance"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/VITDance?fref=ts", "type": "arts"}, {"rating": "4", "about": "There are different kinds of people in this world. Those who have an opinion and those who don't. But the world belongs to a different set of people, those who have an opinion and stand up for it. PRECISELY what the Debate Society of VIT is all about. It is the perfect forum to voice ones opinions, channelize ones feelings towards a particular issue in the right way and bring about a positive change in the listeners mind. Daily practice, copious competition to hone ones skills as a debater are bountiful here. The Debate Society brings out the hidden orator in you, in the most effective way. Email -debsoc@vit.ac.in Website", "name": "DebSoc  VIT", "tags": ["debate"], "abbrivation": "DEBSOC", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vitdebsoc?fref=ts", "type": "arts"}, {"rating": "4", "about": "Life is short, add some drama to it. Life without drama would be utterly boring! Experts in various genres, the members of this club are multi-talented. Rib-tickling comedy or pinching sarcasm or emotional drama, the level of acting, directing and script writing can be compared to those on the silver screen. Their street plays/stage plays put light on todays issues that need to be addressed, and they are put across beautifully and very powerfully. The club is very active and one of the most popular in and outside VIT. The members of the club actively take part in various fests and not winning , isnt even an option.", "name": "Dramatics Club", "tags": ["theater"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/VitDramaClub?fref=ts", "type": "arts"}, {"rating": "4", "about": "Film Society is aimed at film appreciation, rather than considering the cinema as just mere entertainment. Since todays scenario of the Indian Cinema is concentrated more on the Masala movies or just pure fun and the real meaning of the cinema is lost (excluding handful exceptional film makers), they organize events which will promote awareness about the actual cinema and that will judge the students ability to understand movies better. Give Me Love ,Without You , Sangharsh and Muskaan. They have been recognised nationally and have won many accolades for the same. Awards- DWFF AWARDS-BLACK LADY E-mail- vitfilmsociety.vellore@gmail.com Website", "name": "Film Society", "tags": ["theater"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/VITFilmSociety?fref=ts", "type": "arts"}, {"rating": "4", "about": "The Music Club of VIT consists of a bunch of extremely talented musicians who can bring tears to your eyes and touch your soul at one point and can make you head-bang in the craziest way at the next point, such is their talent. This club gives a platform for young budding talents to become the best in what they do. Our versatile performers never fail to inspire us each time they set foot on stage. Even their routine practice sessions blow our minds away! E-mail-musicclubvit@gmail.com", "name": "Music Club", "tags": ["music"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/musicclubvit?fref=tshttps://www.facebook.com/vitquizclub?fref=ts", "type": "arts"}, {"rating": "5", "about": "Its time to flash some skills! Are you the kind of person who loves capturing moments in pictures? Love going through albums time and again and reliving memories? Are you the kind who appreciates photography? The photography club,founded on February 7th 2012, gives you unending chances and instances where you can use your pictures to reach out to everyone else. An opportunity given to its members to cover various events that take place in the campus. The photographs speak for themselves, the talent and techniques used by the photographers are one of a kind. Exciting workshops are held once in a while to teach the unexperienced and make them comfortable with the camera! Email- photographyclubvit@gmail.com", "name": "Photography club", "tags": ["photography"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/shutterbugs.vit?fref=ts", "type": "arts"}, {"rating": "3", "about": "Who is the Vice-President of India? How many times have you been asked this question to know its answer? This quizzy inquisitiveness is what the Quiz Club of VIT is all about. A very popular club, they officially conduct many brainteasing quizzes over the year. Its members have not only brought knowledge to us, but have proved their own genius by carefully striking a balance between good and witty questions.", "name": "Quiz Club", "tags": ["quiz"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vitquizclub?fref=ts", "type": "arts"}, {"rating": "5", "about": "Art is not what you see but what you make others see.With this belief in mind, TFAC endeavours to showcase life as they see it through the eyes of art. From last page doodling to compressed charcoal sketches, from scrap work to comic sketches,from water colors to canvas oil paintings,from abstract and modern art to Marvel and DC comic posters- they celebrate and cherish it all.", "name": "Fine Arts Club", "tags": ["art"], "abbrivation": "TFAC", "clb_or_chap": "club", "facebook": "https://www.facebook.com/TFAC.VIT?fref=ts", "type": "arts"}, {"rating": "4", "about": "Cooking can affect people in profound ways. A spirit of collaboration and sharing is essential to true progress in developing this potential. As the saying goes No one is born a great cook, one only learns by doing. VITs very own Culinary Club aims to do just that by providing an opportunity to learn and reap the benefits of healthy cooking. NutriVITe& VITs MasterCHEF are their major events.", "name": "Culinary Club", "tags": ["food"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/culinaryclubvit?fref=ts", "type": "arts"}, {"rating": "2", "about": "The English Literary Association of VIT strives to hone the all round talents of an individual who wishes to master the universal language - ENGLISH. It facilitates a variety of events that engage you as a listener and a participant. The ELA hosts literary events like what's the good work , 90 seconds , dumb charades , ad zap , ship wreck , block and tackle and a lot more events which serve as great platforms for the students of VIT to exhibit their written and speaking talents. It is responsible for nearly 15 activities in Riviera every year. E.L.A possesses the seriousness associated with a literature club however it also possesses the fun, energy and enthusiasm associated with any college club.", "name": "ENGLISH LITERARY ASSOCIATION", "tags": ["language"], "abbrivation": "ELA", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vituela?fref=ts", "type": "literature"}, {"rating": "2", "about": "This club consists of Avid Kannada speakers who conduct exciting events to perpetuate , promote and safeguard this lovely language in the campus", "name": "KANNADA KASTHURI(KLA)", "tags": ["language"], "abbrivation": "KLA", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vitu.kla?fref=ts", "type": "literature"}, {"rating": "2", "about": "HLA is a group of Hindi enthusiasts who appreciate their national language and wish to endure it. They host a potpourri of events round the year which are not just confined to their language but also serve as a respite from the monotony . Some of their events include Bolvachan(Hindi Extempore), Hunar Hunt 4.O,Vaak Yudh Hindi Parliamentary Debate , Drishtikon Hindi Creative Writing etc.", "name": "HINDI LITERARY ASSOCIATION", "tags": ["language"], "abbrivation": "HLA", "clb_or_chap": "club", "facebook": "https://www.facebook.com/hla.vitu?fref=ts", "type": "literature"}, {"rating": "3", "about": "Remember Adobe Flash? Those small little stick men that would run around the screen? The Animation Club of VIT gives you the platform to showcase, learn and develop skills to dabble with the virtual world. This initiative has been lauded by many in the University and outside, that conduct workshops for nearby universities. Competitions are also conducted regularly to put animators on their toes, or should we say fingers.", "name": "VIT Animation Club", "tags": ["theater"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vitanimationclub?fref=ts", "type": "technology"}, {"rating": "3", "about": "Biology is mind-boggling. Add technology to that, and your mind will be blown! A consortium of biology and engineering , SABEST , founded in the year 2007 (Students Association of Bio-Engineering Science and Technology) is the official students club of SBST. With over 2000 members, it is a highly active society that regularly conducts events related to bio-sciences. It strives to stimulate innovative ideas among its members through its events ranging from group discussions and guest lectures to competitive events such as quizzes. It exposes students to the latest happenings relevant to the field. Some of the events that have been held include Bio-errand (an innovative event where illustrators, artists and cartoonists could portray their ideas on various issues through their creative strokes), Bio-confab (a Group Discussion event) etc Email vit.sabest@hotmail.com Website", "name": "SABEST", "tags": ["biology"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vitsabest?fref=ts", "type": "technology"}, {"rating": "3", "about": "And thus began the era of artificial intelligence... RoboVITics, the official robotics club of VIT was founded in October 2010,. The club was the first technical club to be set up in VIT University, Vellore. The club has been functioning with the students and for the students since then. Team roboVITics has had hands on experience of participation and has won several prizes and accolades in various colleges across India like IIT Bombay, IIT Madras, NIT Trichy, Sastra University, etc. The team organizes various free hands-on workshops, seminars and practical sessions that help out students to know more about robots and build their own projects as well as help them in preparing them for various competitions. The team also organizes several competitions and events for various colleges across India. Team roboVITics is also indulged in several social outreach programmes, where we go and teach the children of various underprivileged schools about science, robotics and electronics. Awards  RoboFest13. Website- www.robovitics.in", "name": "RoboVITics", "tags": ["robotics"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/robovitics?fref=ts", "type": "technology"}, {"rating": "4", "about": "Technology and Gaming Club is the pioneering student club in VIT University leading the student community in the sphere of gaming and game development. They are also actively involved in organising of various gaming festivals during college events.", "name": "TAG", "tags": ["gaming"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/tagvitu", "type": "technology"}, {"rating": "3", "about": "TEC aims to inculcate practical knowledge to the students by providing them a platform to change their ideas into innovations and develop their skills to compete with the present world of electronics.", "name": "TEC", "tags": ["tachnology"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/tec.vit?fref=ts", "type": "technology"}, {"rating": "3", "about": "Fep-Si is an approach to redefine change, through Entertainment, Innovation, Marketing and Management .We believe in redefining the way of bringing Change! \"Redefining Change\" as our logo says, Fep-Si's (Forum For Eradication of Poverty through Social Innovation and Entertainment) vision is to act as a bridge between entertainment and social service. As they embark on this enthusiastic journey, theyve identified that until and unless they empower people and create new leaders  they may not be able to help the bottom billion of our society. IMD CHANGE - a program by Fep-Si believes in creating and mentoring leaders and change makers Their Second Project -Haritha, which functions in collaboration with CSRD&RS (Center for Sustainable Rural Development and Research Studies), VIT University works with an objective of providing a green urban city and its vision is to restore the ecosystem. Their other Projects are -SOCH and UllAS! Email - fepsiindia@gmail.com Website - http://www.fepsi.in/", "name": "fepsi", "tags": ["conservation"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/fepsi.india?fref=ts", "type": "outreach"}, {"rating": "4", "about": "In the spirit of ideas worth spreading, TEDx is a program of local, self-organized events that bring people together to share a TED-like experience. At a TEDx event, TEDTalks video and live speakers combine to spark deep discussion and connection in a small group. These local, self-organized events are branded TEDx, where x = independently organized TED event. The TED Conference provides general guidance for the TEDx program, but individual TEDx events are self-organized.", "name": "TEDx", "tags": ["knowledge"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "outreach"}, {"rating": "3", "about": "Juvenile Care is an NGO working for underprivileged children in India. What sets them apart from similar NGOs? Their basic aim is not to just take care of children, but also empower them through proper care and education. Already having made their mark in cities like Bangalore and Delhi with paper drives, cloth drives etc.; the club has enthusiastic and innovative members who are driven towards a mission.", "name": "Juvenile Care", "tags": ["ngo"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/juvenilecarevit?fref=ts", "type": "outreach"}, {"rating": "2", "about": "When was the last time the plight of our country motivated you to do something? Were sure it was sometime recently? But should you decide to implement it, do you know the official procedure? Do you want to know? Do you want to become more aware of everything thats going around you? This is precisely what Uddeshya does, founded on October 30th 2011. An NGO based in VIT its mission ranges from political awareness and youth empowerment. The motto of this chapter is  Empowering Youth- Fuelling Change. Uddeshyas event called IMPACT- Inspiring More People To Act was a grand success and were hoping to see some change with events like these! Email- contact@uddeshyaindia.org Website - Youth Red Cross  VIT uddeshyaindia.org", "name": "Uddeshya", "tags": ["ngo"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/VIT.Uddeshya?fref=ts", "type": "outreach"}, {"rating": "5", "about": "The YOUTH RED CROSS society in VIT University was established in August, 1999. It is one of the universitys best student clubs that contributes to the welfare of the society by involving youth in Blood Donation camps, First Aid Training camps, Yoga camps, orphanage visits, Swachh Bharat Abhiyan and providing assistance and basic necessities to the orphanages as well as senior citizen homes . Youth Red Cross-VIT have been appreciated and felicitated by Indian red Cross Society as Best Youth Red Cross movement in Tamil Nadu and Best YRC Volunteer award. Youth Red Cross -VIT have organised state level and All India camp for promotion of humanity. The YRC movement is based on the following principles: * Protection of Health and Life * Service to humanity * Promotion of National and International friendship, and to develop the mental and moral capacities of the Youth. E Mail.Id-YRC@vit.ac.in", "name": "Youth Red Cross  VIT", "tags": ["ngo"], "abbrivation": "YRC", "clb_or_chap": "club", "facebook": "https://www.facebook.com/YouthRedCrossVit?fref=ts", "type": "outreach"}, {"rating": "2", "about": "The Hindu Education Plus Club was launched by The Hindu. In its nascent stage, the club is burgeoning with strong will and commendable passion. There is a lot of change, our country needs and much more than that, we wish to see in it. If only we could bring about a smidgen amount of this change.", "name": "THEP", "tags": ["social service"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/groups/vitthehindueplusclub/?fref=ts", "type": "outreach"}, {"rating": "2", "about": "Anokha, the inception of change, is a non-profit organisation in VIT. Their basic aim is to reach out to the children of Vellore and to teach English as well as speaking and communication skills to the children in the orphanages.", "name": "Anokha", "tags": ["social service"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/anokhavit?fref=ts", "type": "outreach"}, {"rating": "1", "about": "COOL THE WORLD is a non-government organisation has been developed to create awareness about global warming & social welfare development. At present, global warming being a big issue for us was the reason the group was formed.", "name": "Cool the world", "tags": ["ngo"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "outreach"}, {"rating": "2", "about": "Edforall or EFA is a youth volunteer organisation started with the primary goal: to add value to lives in a social context. It is one of the very few organisations in the non-profit sector which works with a unique leadership structure, state of the art technology utility programme and an efficient impact model. All the programs run by EFA are a low cost and high impact. EFA works on a positive ecosystem where every single person in the team plays an important role.", "name": "Edforall", "tags": ["social service"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/groups/158318874361002/?fref=ts", "type": "outreach"}, {"rating": "3", "about": "MAD or Make A Difference is an internationally renowned voluntary organisation that empowers children through development at all fields-holistic, health, education and personality development in general. VITs MAD has three different areas where our students are working. They guide and mentor children from various shelter homes and enlighten them about the opportunities that await them and help them in fulfilling their dreams. They also organise various activity based camps annually for the children living in and around Vellore.", "name": "MAD", "tags": ["soclial service"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/makeadiff?fref=ts", "type": "outreach"}, {"rating": "1", "about": "KALVI, a subtly beautiful Tamil word that means Education, seemed to represent our thoughts perfectly. In a modest manner it suggests what the club wants to spread. The club goes out to schools which lack in resources to teach and helps them by providing the necessary supplies and thus helps them to gain access to quality education. The sole ambition of the club is to eradicate illiteracy.", "name": "KALVI! We nurture tomorrow!", "tags": ["social service"], "abbrivation": "KALVI", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vitkalvi?fref=ts", "type": "outreach"}, {"rating": "4", "about": "Spartans is one club of VIT that wants to discover the hidden talents of people. It gives everyone who joins a platform to showcase any latent talent or any idea that hasnt received accreditation. It does so by hosting a huge variety of events in which students can participate. It again helps one communicate socially and improves their confidence level.", "name": "VIT SPARTANS", "tags": ["talent search"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/vitspartans?fref=ts", "type": "outreach"}, {"rating": "3", "about": "This is a club which believes in social service. The clubs goes to the nearby slums and helps people improve their lifestyle. The club also focuses on improving the leadership qualities and managerial skills of its members. It is huge with around 300 members and holds make records to its fame.", "name": "Rotaract Club", "tags": ["social service"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/RotaractVit?fref=ts", "type": "outreach"}, {"rating": "4", "about": "Becoming I Foundation is an internationally recognized youth led organization that mobilizes young people into engaging with community development issues. Through projects in the fields of women empowerment, trafficking, primary education, alternate sources of employment, leadership training, life skills development and youth empowerment, we have had a direct and indirect impact on more than 5000 young people all across the globe. Our volunteers come from varied socio-cultural backgrounds, ranging from school students to working professionals who are all unanimously committed to making a difference. Our organization is structurally divided into a core board, an editorial and communications team, a set of project coordinators and our pool of volunteers all of whom democratically interact to realize our project goals. Four projects, two fund-raising events and multiple campaigns later, we have still maintained the very belief system with which the organization was created: To identify and mobilize future change-makers from every section in society.", "name": "Becoming I Foundation", "tags": ["ngo"], "abbrivation": "BIF", "clb_or_chap": "club", "facebook": "", "type": "outreach"}, {"rating": "4", "about": "The health club of VIT believes in the motto  A healthy habit, a healthy world. This club reaches out to the poor and needy and try to help them in every possible way. The most recent event was Anandham which was held on World Happiness Day. Our students graced the occasion with their performances, and spread smiles all around. An initiative called Paropkar was also carried out where our students extended their valuable support towards the needy by donating generously day to day items like mattresses, buckets etc because every little gesture by us would make a world of a difference to someone else.", "name": "Health Club", "tags": ["fitness", "health"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/healthclubvit?ref=ts&fref=ts", "type": "awareness"}, {"rating": "4", "about": "Sitting in Vellore and longing for some thrill and adventure? Does trekking seem like a good option? The Trekking Club was founded on 9th July 2010. Their activities include trekking workshops, rock climbing , trekking to mountains and reserve forests , spreading awareness about eco-tourism and working for the welfare of tribal communities- Trek for a cause! The club ensures to fulfil your longing for some adventure and adds lots of fun to the list! Website- http://trekkingclubvit.blogspot.in/", "name": "Trekking Club", "tags": ["adventure"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/VitTrekkingClub?fref=ts", "type": "awareness"}, {"rating": "4", "about": "Unless you do something beyond what you've already mastered, you will never grow. Assailing Falcons , we believe that these two words are enough to describe us a team . Falcons , Fascinating creatures on earth which can be both frightening and majestic at the same time.Whether it's gliding up high in the air rushing against the wind of glory or it's diving towards our target , We work with a pioneering spirit that puts innovation at the heart of everything we do.Being the oldest aero design team of VIT , We build aircrafts of various sizes and functionality and take part in various international and national competitions. Primarily taking part in the SAE Aero Design competition in the regular class and advance class, Assailing Falcons is known for its highly radical and unique designs of aircrafts.In an endevour to out do ourselves every year, we put our heart and soul in every aspect of our aircraft, starting from design and analysis to fabrication and testing.", "name": "Assailing Falcons", "tags": ["plane", "flight"], "abbrivation": "", "clb_or_chap": "club", "facebook": "https://www.facebook.com/AssailingFalcons?fref=ts", "type": "sae"}, {"rating": "3", "about": "You have never seen an aircraft until you have seen its shadow from the sky. We at Flying Inc. are a group of aero enthusiasts united by the passion of designing aircrafts and together we fulfill the passion of Howard Hughes, the will of Wright brothers and a desire to prove the same.A melange of design, technology and ingenuity where both creativity and innovation come together, we instill high standards of technicality and willpower into our designs through our dedicated team members. Being the oldest Aero-design team in VIT formed in 2011, Team Flying INC has designed and fabricated aircrafts of different sizes and continued its tradition of Flying High and raising the bar of excellence in the field of aviation. Primarily taking part in the SAE Collegiate Series organized by Lockheed Martin, Flying INC. is renowned for its creative designs and innovative techniques incorporated into every one of its prototypes and reflected into our achievements. We dream, we dare and we fly.for if it wasn't for dreams man would be still walking on the ground.", "name": "Team Flying Inc", "tags": ["plane", "flight"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "2", "about": "Team Kshatriya was founded in the year 2006 , by a group of B.Tech Mechanical Engineering students of VIT University. We started with the objective of bringing together those brains which are diligently working on a myriad of inventive technologies, and to provide them with a forum for free exchange of ideas and expose them to the latest innovations in terms of automotive engineering. The most important part is we have knowledge and 'lessons learnt from mistakes' passed on from the seniors to the juniors and this is what makes us unique! Today, we are gearing up for BAJA INDIA 2015 and looking forward to the challenge ahead!", "name": "Team Kshatriya", "tags": ["car", "racing", "atv"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "5", "about": "Pravega Racing is the official Formula Student Combustion team from VIT,Vellore. We design, manufacture and race an F1 prototype racecar and race our car at different competitions around the world.Formula Student organized by SAE(Society of Automotive Engineers) is the world's largest engineering competition.We have participated in Formula Student events at Nebraska(2010), Italy(2011,2012,2013) and Germany(2014,2015). We also participated in the first ever Formula Student India which was held at Coimbatore in January 2015.Our performance in Germany this year was the best by any Indian team till date.Our aim is to gain first hand experience in the field of automotive sector and help build India's name in student motorsport world. Currently, we are the best ranked team from India according to latest world rankings.We have always believed that with the right mindset and smart use of available resources, we can achieve any target.  Our team emphasizes equally on project management as it does on the technical aspects. These events help in bridging the gap between students and industry and also gain valuable practical experience.", "name": "Pravega Racing", "tags": ["car", "racing"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "3", "about": "VIT's SAE Aero Design: Micro and Advanced Class Team. We are a bunch of enthusiastic students and RC builders from VIT University, who apply the concepts, laws and principles of engineering sciences and aerodynamics to design and fabricate a Micro Aerial Vehicle. For us, in Team Vimanaas, the sky is just the beginning.", "name": "Team Vimaanas", "tags": ["plane", "flight"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "4", "about": "Team JAABAZ is a dynamic MINI-BAJA team from Vellore Institute of Technology, India, founded in 2008. Jaabaz means Fearless in Persian, and we, as a team are fortitude personified. This is the spirit we strive to move ahead with in the world of BAJA, which is our area of deep interest, the enthralling world of All Terrain Vehicles (ATV). Baja SAE is an intercollegiate design competition run by the Society of Automotive Engineers (SAE).Students must function as a team to not only design, build, test, promote and race off-road vehicles that can withstand the harshest elements of rough terrain of the rules, but also to generate financial support for their project.", "name": "Team Jabaaz", "tags": ["car", "racing", "atv"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "2", "about": "KI is a racing team in VIT University, Vellore. It is their brainchild of the students studying in their undergraduate years especially in the mechanical department. The team represents itself at the BAJA SAE event held in the US every year. The team has been excelling since its inception in 2011. It's in good shape after achieiving the 54th rank at the event held in Oregon this year.", "name": "KI Racing", "tags": ["car", "racing", "mechanical"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "4", "about": "Team OJAS is the official Formula Electric team of VIT university. The team was founded in 2011 and has since been taking part in various Formula Student events held in different parts of Europe. At the time of inception, OJAS was one of the two Electric teams in India alongside the electric team of IIT Bombay. Since then, various Formula teams have emerged but the exclusivity still remains. The team has so far participated in 4 formula student events; twice in UK once in Italy and then in Germany. The team's participation in FS Germany is still a dream for many Indian teams and Team Ojas is the first ever Indian electric team to have participated in FS Germany. Our first car was a hybrid car and it represented the team at Formula student UK held at Silverstone and organized by the IMechE(institution of Mechanical engineers).", "name": "Team Ojas", "tags": ["car", "racing", "electric"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "3", "about": "Team Uttejit is an automotive team in VIT University. We are involved in designing and manufacturing vehicles to compete under the Pure Electric category and certain hybrid types in Go-Karts. These are a separate class of competitions, which have been realized by SAE, ISNEE and other bodies lately, owing to the Energy Crisis.Our motive is to provide Ergonomically and Economically feasible vehicles which can be socially viable and solving a part of the power crisis in the world.", "name": "Team Uttejit", "tags": ["car", "racing", "hybrid"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "2", "about": "The team targets to build a Super Mileage Vehicle that will represent VIT University and India, in Shell Eco Marathon Asia-2016", "name": "Eco Titans", "tags": ["car", "eco"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "4", "about": "Team RoverX, is a team of engineering undergraduates from VIT University, Vellore, India. The team is made up of a very diverse group, predominately made up of members from several disciplines of engineering including mechanical, electrical, computer, and biomedical students.Though, the team members come from different backgrounds of engineering, we are united by the common passion for designing, constructing and bringing innovation to technology and the team's unperturbed desire to learn more.", "name": "Team RoverX", "tags": ["rover"], "abbrivation": "", "clb_or_chap": "club", "facebook": "", "type": "sae"}, {"rating": "6", "about": "Events - All the biggest Google related events extended including the Devfest, Google I/O and Google Cloudnext Summit. Workshops - Full-day of workshops, hands-on experience, hacking and debugging. Come and tame your favourite technology! Hackathon - Full-day freestyle hackathon! Want some real team building on fridays? Grab your team and join our hackathons!", "name": "Google Developers Group - VIT Vellore", "tags": ["software", "developement", "computer science"], "abbrivation": "gdg", "clb_or_chap": "chapter", "facebook": "", "type": "university"}]